# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLO11 object detection model with P3-P5 outputs, combining DynamicConv, DAT, and AIFI.

# Parameters
nc: 80  # number of classes
scales:
  n: [0.50, 0.25, 1024]  # YOLO11n
  s: [0.50, 0.50, 1024]  # YOLO11s
  m: [0.50, 1.00, 512]   # YOLO11m
  l: [1.00, 1.00, 512]   # YOLO11l
  x: [1.00, 1.50, 512]   # YOLO11x

# YOLO11-Enhanced backbone
backbone:
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  - [-1, 2, C3k2_DynamicConv, [256, False, 0.25]]  # DynamicConv
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]]  # 5-P4/16
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]  # 7-P5/32
  - [-1, 2, C3k2_DynamicConv, [1024, True]]  # DynamicConv
  - [-1, 1, AIFI, [1024, 8]]  # 改进FPN
  - [-1, 2, C2PSA_LSKA, [1024]] # 10

# YOLO11-Enhanced head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]  # cat backbone P4
  - [-1, 2, C3k2_DynamicConv, [512, False]]  # DynamicConv

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]  # cat backbone P3
  - [-1, 2, C3k2_DynamicConv, [256, False]]  # Standard
  # - [-1, 2, C3k2, [256, False]]  # Standard
 
  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]]  # cat head P4
  # - [-1, 2, C3k2_DynamicConv, [512, False]]
  - [-1, 2, C3k2, [512, False]]

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]]  # cat head P5
  - [-1, 2, C3k2, [1024, True]]

  - [[16, 19, 22], 1, Detect, [nc]]  # Detect(P3, P4, P5)
