# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLO11n object detection model with P3-P5 outputs.

# Parameters
nc: 80 # number of classes
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# YOLO11n backbone (融合改进)
backbone:
  [
    [-1, 1, Silence, []],

    # conv down
    [-1, 1, Conv, [64, 3, 2]],  # 1-P1/2
    [-1, 1, Conv, [128, 3, 2]],  # 2-P2/4

    # C3k2_DynamicConv 替换 C3k2
    [-1, 2, C3k2_DynamicConv, [256, False, 0.25]],  # 3
    [-1, 1, Conv, [256, 3, 2]],  # 4-P3/8
    [-1, 2, C3k2_DynamicConv, [512, False, 0.25]],  # 5
    [-1, 1, Conv, [512, 3, 2]],  # 6-P4/16
    [-1, 2, C3k2_DynamicConv, [1024, True]],  # 7
    [-1, 1, Conv, [1024, 3, 2]],  # 8-P5/32
    [-1, 2, C3k2_DynamicConv, [1024, True]],  # 9

    # CBLinear 结构
    [1, 1, CBLinear, [[64]]],  # 10
    [3, 1, CBLinear, [[64, 128]]],  # 11
    [5, 1, CBLinear, [[64, 128, 256]]],  # 12
    [7, 1, CBLinear, [[64, 128, 256, 512]]],  # 13
    [9, 1, CBLinear, [[64, 128, 256, 512, 1024]]],  # 14

    # CBFuse 结构
    [0, 1, Conv, [64, 3, 2]],  # 15-P1/2
    [[10, 11, 12, 13, 14, -1], 1, CBFuse, [[0, 0, 0, 0, 0]]],  # 16

    [-1, 1, Conv, [128, 3, 2]],  # 17-P2/4
    [[11, 12, 13, 14, -1], 1, CBFuse, [[1, 1, 1, 1]]],  # 18

    # 继续 Backbone 结构
    [-1, 2, C3k2_DynamicConv, [256, False, 0.25]],  # 19
    [-1, 1, Conv, [256, 3, 2]],  # 20-P3/8
    [[12, 13, 14, -1], 1, CBFuse, [[2, 2, 2]]],  # 21

    [-1, 2, C3k2_DynamicConv, [512, False, 0.25]],  # 22
    [-1, 1, Conv, [512, 3, 2]],  # 23-P4/16
    [[13, 14, -1], 1, CBFuse, [[3, 3]]],  # 24

    [-1, 2, C3k2_DynamicConv, [1024, True]],  # 25
    [-1, 1, Conv, [1024, 3, 2]],  # 26-P5/32
    [[14, -1], 1, CBFuse, [[4]]],  # 27

    [-1, 2, C3k2_DynamicConv, [1024, True]],  # 28
  ]

# YOLO11n head (融合改进)
head:
  [
    [28, 1, SPPF, [1024, 5]],  # 29
    [-1, 2, C2PSA, [1024]],  # 30

    # up-concat merge
    [-1, 1, nn.Upsample, [None, 2, 'nearest']],
    [[-1, 25], 1, Concat, [1]],  # cat backbone P4

    [-1, 2, C3k2_DynamicConv, [512, False]],  # 33

    # up-concat merge
    [-1, 1, nn.Upsample, [None, 2, 'nearest']],
    [[-1, 22], 1, Concat, [1]],  # cat backbone P3

    [-1, 2, C3k2_DynamicConv, [256, False]],  # 36 (P3/8-small)

    [-1, 1, Conv, [256, 3, 2]],
    [[-1, 33], 1, Concat, [1]],  # cat head P4

    [-1, 2, C3k2_DynamicConv, [512, False]],  # 39 (P4/16-medium)

    [-1, 1, Conv, [512, 3, 2]],
    [[-1, 30], 1, Concat, [1]],  # cat head P5

    [-1, 2, C3k2_DynamicConv, [1024, True]],  # 42 (P5/32-large)

    [[36, 39, 42], 1, Detect, [nc]],  # Detect(P3, P4, P5)
  ]
